kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
    case BUTTERFI_USB_FRAME_HOST_RESEND_REQUEST:
#if BUTTERFI_USB_CONTROL_DEBUG || !BUTTERFI_INCLUDE_SIDEWALK
        (void)butterfi_usb_send_transfer_error(request_id,
                                               BUTTERFI_USB_ERROR_SIDEWALK_UNAVAILABLE,
                                               "usb control debug build");
        break;
#else
        if (payload_len != 1 || !request_in_flight || request_id != active_request_id) {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_PROTOCOL_MISMATCH,
                                                   "invalid resend request");
            break;
        }

        if (sidewalk_state != SIDEWALK_STATE_READY || sid_handle == NULL) {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_SIDEWALK_UNAVAILABLE,
                                                   sidewalk_unavailable_reason());
            break;
        }

        sid_err = send_sidewalk_uplink(BUTTERFI_SIDEWALK_MSG_RESEND,
                                       request_id,
                                       payload,
                                       payload_len);
        if (sid_err != SID_ERROR_NONE) {
            LOG_ERR("Resend uplink failed: %d", sid_err);
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_CLOUD_FETCH_FAILED,
                                                   "resend uplink failed");
            break;
        }

        (void)butterfi_usb_send_uplink_accepted(request_id);
        break;
#endif

    case BUTTERFI_USB_FRAME_HOST_CANCEL_REQUEST:
        if (request_in_flight && request_id == active_request_id) {
            ignored_request_id = request_id;
            reset_transfer_state();
            current_led_state = (sidewalk_state == SIDEWALK_STATE_READY)
                ? LED_STATE_CONNECTED
                : LED_STATE_CONNECTING;
        } else {
            (void)butterfi_usb_send_transfer_error(request_id,
                                                   BUTTERFI_USB_ERROR_PROTOCOL_MISMATCH,
                                                   "request not active");
        }
        break;

    default:
        (void)butterfi_usb_send_transfer_error(request_id,
                                               BUTTERFI_USB_ERROR_PROTOCOL_MISMATCH,
                                               "unsupported host frame");
        break;
    }
}

#if BUTTERFI_INCLUDE_SIDEWALK
/* ── Sidewalk event callbacks ───────────────────────────────────────────── */
static void on_sidewalk_event(bool in_isr, void *context)
{
    /* Called when a Sidewalk event is pending; process from main thread */
    k_sem_give(&sidewalk_event_sem);
}

static void on_msg_received(const struct sid_msg_desc *msg_desc,
                             const struct sid_msg *msg,
                             void *context)
{
    const uint8_t *payload = msg->data;
    uint8_t request_id;
    uint8_t chunk_idx;
    uint8_t total_chunks;
    bool is_new_chunk;

    ARG_UNUSED(context);

    LOG_INF("MSG RX: type=%d, id=%u, size=%u",
            msg_desc->type, msg_desc->id, msg->size);

    if (payload == NULL || msg->size < 4 || payload[0] != BUTTERFI_SIDEWALK_MSG_RESPONSE_CHUNK) {
        LOG_WRN("Ignoring unexpected Sidewalk downlink payload");
        return;
    }

    request_id = payload[1];
    chunk_idx = payload[2];
    total_chunks = payload[3];

    if (total_chunks == 0 || chunk_idx >= total_chunks) {
        (void)butterfi_usb_send_transfer_error(request_id,
                                               BUTTERFI_USB_ERROR_PROTOCOL_MISMATCH,
                                               "invalid chunk metadata");
        return;
    }

    if (!request_in_flight) {
        if (request_id == ignored_request_id) {
            LOG_INF("Ignoring chunk for cancelled request %u", request_id);
            return;
        }

        start_transfer_state(request_id);
    }

    if (request_id != active_request_id) {
        LOG_WRN("Ignoring chunk for request %u while %u is active", request_id, active_request_id);
        return;
    }

    if (active_total_chunks == 0) {
        active_total_chunks = total_chunks;
    } else if (active_total_chunks != total_chunks) {
        (void)butterfi_usb_send_transfer_error(request_id,
                                               BUTTERFI_USB_ERROR_PROTOCOL_MISMATCH,
                                               "chunk total changed");
        reset_transfer_state();
        return;
    }

    is_new_chunk = mark_chunk_received(chunk_idx);
    current_led_state = LED_STATE_SENDING;
    (void)butterfi_usb_send_response_chunk(request_id, payload, msg->size);

    if (is_new_chunk && received_chunk_count == active_total_chunks) {
        (void)butterfi_usb_send_transfer_complete(request_id);
        current_led_state = LED_STATE_CONNECTED;
        reset_transfer_state();
    }
}

static void on_msg_sent(const struct sid_msg_desc *msg_desc, void *context)
{
    LOG_INF("MSG TX ACK: id=%u", msg_desc->id);
    current_led_state = LED_STATE_CONNECTED;
}

static void on_send_error(sid_error_t error,
                          const struct sid_msg_desc *msg_desc,
                          void *context)
{
    char dbg[64];

    ARG_UNUSED(context);

    LOG_ERR("MSG TX ERR: %d (id=%u)", error, msg_desc->id);
    (void)snprintk(dbg, sizeof(dbg), "SID send err=%d id=%u", error, msg_desc->id);
    (void)butterfi_usb_send_debug_text(dbg);
    current_led_state = LED_STATE_CONNECTED;

    if (request_in_flight) {
        (void)butterfi_usb_send_transfer_error(active_request_id,
                                               BUTTERFI_USB_ERROR_CLOUD_FETCH_FAILED,
                                               "sidewalk transmission failed");
        reset_transfer_state();
    }
}

static void on_status_changed(const struct sid_status *status, void *context)
{
    char dbg[96];

    LOG_INF("Sidewalk status: state=%d, reg=%d, time=%d, link_mask=0x%08x",
            status->state,
            status->detail.registration_status,
            status->detail.time_sync_status,
            status->detail.link_status_mask);

    /* Mirror the Sidewalk status detail out over USB so it can be observed
     * without a debug probe (the Zephyr console is disabled on this build). */
    (void)snprintk(dbg, sizeof(dbg),
                   "SID state=%d reg=%d time=%d linkmask=0x%08x",
                   status->state,
                   status->detail.registration_status,
                   status->detail.time_sync_status,
                   status->detail.link_status_mask);
    (void)butterfi_usb_send_debug_text(dbg);

