kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
    switch (status->state) {
    case SID_STATE_READY:
    case SID_STATE_SECURE_CHANNEL_READY:
        sidewalk_state = SIDEWALK_STATE_READY;
        current_led_state = LED_STATE_CONNECTED;
        LOG_INF("Sidewalk READY — ButterFi online");
        break;

    case SID_STATE_NOT_READY:
        sidewalk_state = SIDEWALK_STATE_INIT;
        current_led_state = LED_STATE_CONNECTING;
        break;

    case SID_STATE_ERROR:
        sidewalk_state = SIDEWALK_STATE_ERROR;
        current_led_state = LED_STATE_ERROR;
        LOG_ERR("Sidewalk ERROR");
        break;
    }

    current_link_state = (status->detail.link_status_mask & SID_LINK_TYPE_1)
        ? BUTTERFI_USB_LINK_BLE
        : BUTTERFI_USB_LINK_UNKNOWN;

    if (status->detail.registration_status == SID_STATUS_NOT_REGISTERED) {
        sidewalk_state = SIDEWALK_STATE_NOT_REGISTERED;
        current_led_state = LED_STATE_UNPROVISIONED;
        LOG_WRN("Device not registered — missing Sidewalk credential or onboarding");
    }

    refresh_usb_status();
}

static void on_factory_reset(void *context)
{
    LOG_WRN("Factory reset triggered via Sidewalk");
    butterfi_config_clear();
    reset_transfer_state();
    sys_reboot(SYS_REBOOT_COLD);
}

static struct sid_event_callbacks sidewalk_callbacks = {
    .context        = NULL,
    .on_event       = on_sidewalk_event,
    .on_msg_received = on_msg_received,
    .on_msg_sent    = on_msg_sent,
    .on_send_error  = on_send_error,
    .on_status_changed = on_status_changed,
    .on_factory_reset  = on_factory_reset,
};

static int sidewalk_platform_init_once(void)
{
    static bool platform_ready;
    platform_parameters_t platform_parameters = {
        .mfg_store_region = {
            .addr_start = PM_MFG_STORAGE_ADDRESS,
            .addr_end = PM_MFG_STORAGE_END_ADDRESS,
        },
    };
    sid_error_t err;

    if (platform_ready) {
        return 0;
    }

    err = sid_platform_init(&platform_parameters);
    if (err != SID_ERROR_NONE) {
        LOG_ERR("sid_platform_init failed: %d", err);
        return -EFAULT;
    }

    platform_ready = true;
    return 0;
}

static int sidewalk_init(void)
{
    int ret;
    struct sid_end_device_characteristics dev_ch = {
        .type = SID_END_DEVICE_TYPE_STATIC,
        .power_type = SID_END_DEVICE_POWERED_BY_BATTERY_AND_LINE_POWER,
        .qualification_id = 0x0001,
    };

    /* The Sidewalk stack retains the pointer passed to sid_init(), so this
     * config (like the callbacks it references) must live in static storage,
     * not on sidewalk_init()'s stack — otherwise it is a use-after-scope once
     * this function returns, which manifests as the stack silently doing
     * nothing (no crash, no error). Assigned at runtime because
     * app_get_ble_config() is not a constant initializer. */
    static struct sid_config config;

    config.link_mask = SID_LINK_TYPE_1;
    config.dev_ch = dev_ch;
    config.callbacks = &sidewalk_callbacks;
    config.link_config = app_get_ble_config();
    config.sub_ghz_link_config = NULL;
    config.log_config = NULL;
    config.time_sync_config = &default_time_sync_config;

    ret = sidewalk_platform_init_once();
    if (ret < 0) {
        return ret;
    }

    sid_error_t err = sid_init(&config, &sid_handle);
    if (err != SID_ERROR_NONE) {
        LOG_ERR("sid_init failed: %d", err);
        return -EFAULT;
    }

    err = sid_start(sid_handle, SID_LINK_TYPE_1);
    if (err != SID_ERROR_NONE) {
        LOG_ERR("sid_start failed: %d", err);
        return -EFAULT;
    }

    /* Ask the stack to actively establish and hold a BLE gateway connection.
     * Without an auto-connect policy the device only passively accepts brief
     * gateway connections, which drop before time sync / registration can
     * complete — so it never leaves SID_STATUS_NOT_REGISTERED. This mirrors
     * the CONFIG_SID_END_DEVICE_AUTO_CONN_REQ path in the Nordic
     * sid_end_device reference sample. */
    {
        enum sid_link_connection_policy conn_policy =
            SID_LINK_CONNECTION_POLICY_AUTO_CONNECT;
        struct sid_link_auto_connect_params ac_params = {
            .link_type = SID_LINK_TYPE_1,
            .enable = true,
            .priority = 0,
            .connection_attempt_timeout_seconds = 30,
        };

        err = sid_option(sid_handle, SID_OPTION_SET_LINK_CONNECTION_POLICY,
                         &conn_policy, sizeof(conn_policy));
        if (err != SID_ERROR_NONE) {
            LOG_ERR("set connection policy failed: %d", err);
        }

        err = sid_option(sid_handle, SID_OPTION_SET_LINK_POLICY_AUTO_CONNECT_PARAMS,
                         &ac_params, sizeof(ac_params));
        if (err != SID_ERROR_NONE) {
            LOG_ERR("set auto-connect params failed: %d", err);
        }
    }

    LOG_INF("Sidewalk stack started");
    return 0;
}
#endif

/* ── LED blink thread ───────────────────────────────────────────────────── */
#define LED_STACK_SIZE 512
#define LED_PRIORITY   7

static void led_thread_fn(void *a, void *b, void *c)
{
    int tick = 0;

    gpio_pin_configure_dt(&led_r, GPIO_OUTPUT_INACTIVE);
    gpio_pin_configure_dt(&led_g, GPIO_OUTPUT_INACTIVE);
    gpio_pin_configure_dt(&led_b, GPIO_OUTPUT_INACTIVE);

    while (1) {
        tick++;

        if (boot_fingerprint_ticks > 0U) {
            boot_fingerprint_ticks--;
            led_set(1, 1, 1);
            k_msleep(250);
            continue;
        }

        if (usb_rx_error_led_ticks > 0U) {
            led_set(1, 1, 0);
            k_msleep(250);
            continue;
        }

        if (usb_rx_byte_led_ticks > 0U) {
            led_set(0, 0, 1);
            k_msleep(250);
            continue;
        }

        if (usb_tx_err_led_ticks > 0U) {
            led_set(1, 0, 1);
            k_msleep(250);
            continue;
        }

        if (usb_tx_ok_led_ticks > 0U) {
            led_set(1, 1, 1);
            k_msleep(250);
            continue;
        }

        if (host_frame_led_ticks > 0U) {
            led_set(0, 1, 1);
            k_msleep(250);
            continue;
        }

        switch (current_led_state) {
        case LED_STATE_BOOT:
            led_set(0, 0, tick % 4 < 2);         /* blue pulse        */
            break;
        case LED_STATE_UNPROVISIONED:
            led_set(tick % 8 < 1, 0, 0);          /* red slow blink    */
            break;
        case LED_STATE_CONNECTING:
            led_set(tick % 4 < 2, tick % 4 < 2, 0); /* yellow blink    */
            break;
        case LED_STATE_CONNECTED:
            led_set(0, 1, 0);                      /* green solid       */
            break;
        case LED_STATE_SENDING:
            led_set(1, 1, 1);                      /* white flash       */
            break;
        case LED_STATE_ERROR:
            led_set(tick % 2, 0, 0);               /* red fast blink    */
            break;
        }
        k_msleep(250);
    }
}

